{
  "无舌头": {
    "status": "failed",
    "msg": "未检测到舌头"
  },
  "有舌头": {
    "正常": {
      "无齿痕": {
        "status": "succeed",
        "type": "舌形",
        "describe": "没有检测到不良症状",
        "recommend": "1.多吃新鲜蔬菜水果；\n2.多运动，保持身体健康；\n3.保持心情愉悦，多与朋友交流；\n4.保持良好的作息习惯；\n5.多喝水，保持身体水分充足；\n6.多吃富含维生素的食物；\n7.避免暴饮暴食，保持良好的饮食习惯；\n8.避免熬夜，保证充足的睡眠。"
      },
      "有齿痕": {
        "status": "succeed",
        "type": "舌形",
        "describe": [
          "气虚体质典型舌象\n淡胖舌，有齿痕\n舌质：偏淡\n舌苔：白\n舌体：胖大，边有齿痕\n此类舌象多见于亚健康人群。此舌象患者或有消化不良、四肢乏力、大便不成形等症状",
          "阴虚体质典型舌象\n深红舌，苔偏薄\n舌苔：干燥厚腻且发白\n舌质：红\n舌面：有一条深裂纹，两边有齿痕\n此舌象提示患者阴虚内热、脾肾阴虚。常见神疲乏力、口燥咽干、心烦失眠、头晕耳鸣等症状。",
          "湿热体质典型舌象\n胖大舌，深黄腻苔\n舌体：胖大，有齿痕\n舌苔：深黄、厚腻\n舌面：有裂纹、瘀斑\n此舌象患者或有发热、身热不扬，头痛而重、身重而痛、口干口苦、小便短赤、大便干结等症状。"
        ],
        "recommend": [
          "方药：主要采用人参、白术、茯苓、甘草、山药、桔梗、白扁豆、莲子肉、砂仁、薏米、陈皮、红枣、干姜等组方，成药可以选用参苓白术丸、健脾丸等。\\n穴位疗法：主要选取脾俞、胃俞、中脘、天枢、关元等穴位，针用补法，适宜艾灸足三里、三阴交等。",
          "方药：可选用柑橘汤加半夏厚朴汤、二陈汤、罗汉果、鱼腥草、蒲公英、南沙参、杏仁、西洋参等配合使用。成药可以选择清咽利喉颗粒和清咽片。\n穴位疗法：选择风池穴、廉泉穴、天突穴、水突穴、膻中穴、曲池穴、合谷穴、列缺穴、足三里穴、丰隆穴、三阴交穴、太冲穴、中脘穴等。",
          "方药：可选用等量黄檗、蒲公英、苦参组方磨成粉外敷。内服选用龙胆草、栀子、甘草、生地黄、当归、大青叶、连翘、元胡、车前子、泽泻等组方。成药可选用龙胆泻肝汤丸等。\n穴位疗法：选择足三里穴、阴陵泉穴、三阴交穴、丰隆穴、风市穴、委中穴、膀胱俞穴、大肠俞穴、肾俞穴等。"
        ]
      }
    },
    "白": {
      "无齿痕": {
        "status": "succeed",
        "type": "舌象",
        "describe": [
          "舌苔的颜色\n白苔——湿浊痰饮\n舌苔薄白为正常舌苔或表证初起。苔薄白而润滑，为里寒症、寒湿症；苔薄白而腻，为湿浊、痰饮。\n根据舌苔的湿润度、薄厚，可以分为薄白苔、白滑苔、白干苔、白积粉苔等",
          "舌苔的厚度\n腻苔——湿浊蕴结\n舌苔颜色发白，粘附在舌头表面，表示体内虚寒且充满湿气；如果舌苔颜色发黄，表示体内湿邪或痰浊蕴结化热。\n表示湿浊蕴结、阳气被遏制，主痰湿、食积",
          "舌形与舌面\n舌有齿痕——阳气虚\n舌体偏白，舌苔偏白，说明脾肾阳虚、身体内有水湿痰饮。\n此舌象的舌质非常柔软，说明身体阳气虚，体能有所衰退。"
        ],
        "recommend": [
          "白腻苔者可艾灸养心止汗，白汗气短伴有经常感冒，脸色发白，容易疲劳等症状，可以选择艾灸神阙穴，关元穴，等腹部穴位，每天灸15-20分钟；\n白糙裂苔者常饮荷叶茶，莲子心及荷叶具有清热养神，降压利尿，敛液止汗，止血固精等功效。",
          "白腻苔可以靠晒太阳补阳气，中医里说，太阳可以是人体阳气的直接或间接来源，而且身体能否抵御住外界的侵袭，各种功能能否正常运行等，都是必须要以充足的阳气作为基础的，多晒太阳对于舌苔白腻的人大有好处；\n按摩大椎穴，脊柱是督脉循经的不问，督脉可以调节全身的阳经，按揉大椎穴可以疏通督脉经络，调畅气血，充足阳气。",
          "适量运动，补肺化痰，肺是贮存有形之痰的脏器，痰湿体制必须益气养肺，最好的方法就是多运动，因为运动可使肺叶扩张，呼出更多的二氧化碳，吸入更多的氧气，锻炼和增强肺功能，提高抗病能力；\n按摩三阴交，经常按摩三阴交穴，可补肝，脾，肾，三经的气血，三经气血调和，则先天之精气旺盛，后天气血充足，因而可以达到行气活血的目的。"
        ]
      },
      "有齿痕": {
        "status": "succeed",
        "type": "舌形",
        "describe": [
          "气虚体质典型舌象\n暗红舌，胖大舌\n舌质：暗红\n舌苔：薄白、微干\n舌体：两边有齿痕\n此舌象患者或有精神疲劳、手足心热、胃脘痞满、食欲缺乏、面色苍白、心烦不舒等症状",
          "气虚体质典型舌象\n淡胖舌，有齿痕\n舌质：偏淡\n舌苔：白\n舌体：胖大，边有齿痕\n此类舌象多见于亚健康人群。此舌象患者或有消化不良、四肢乏力、大便不成形等症状",
          "阴虚体质典型舌象\n瘦红舌，苔薄白\n舌质：暗红\n舌苔：薄白、微干\n舌体：两边有齿痕\n瘦红舌大多是由于肝肾阴虚、瘀毒内蕴形成的。此舌象患者或伴有头晕目眩、目干、容易疲劳等",
          "痰湿体质典型舌象\n舌紫红，有瘀斑\n舌质：淡\n舌苔：白腻\n舌体：胖大，有齿痕\n这种舌象多由脾失健运，痰浊内生，痰浊中阻，上蒙清窍所致。"
        ],
        "recommend": [
          "舌质暗红舌苔厚腻舌体胖大有齿痕一般与湿邪或体寒等因素有关。如果患者体内湿邪较重，容易导致气血运化不良，引起舌头部位循环障碍，舌体就会变大，两边受到牙齿挤压就会形成齿痕。另外，如果患者体寒，容易出现舌苔厚，可能会出现舌质暗红、舌体胖大等症状。建议患者平时不要食用油腻、过甜的食物。",
          "方药：主要采用人参、白术、茯苓、甘草、山药、桔梗、白扁豆、莲子肉、砂仁、薏米、陈皮、红枣、干姜等组方，成药可以选用参苓白术丸、健脾丸等。\n穴位疗法：主要选取脾俞、胃俞、中脘、天枢、关元等穴位，针用补法，适宜艾灸足三里、三阴交等。",
          "方药：中药以知母、黄檗、生地黄、熟地黄、山茱萸、牡丹皮、山药、泽泻、土茯苓、赤芍、白芍、半枝莲、龟甲、黄芩、杜仲等组方。\n穴位疗法：取穴主要有肾俞穴、关元穴、中极穴、三阴交穴等，并根据患者具体体质状况选择补法和泻法或补泻兼施。",
          "方药：中药以柴胡、郁金、菖蒲、桃仁、红花等为主药，并可酌情配合白僵蚕、炙全蝎等虫类药物疏通经络。成药有血府逐瘀胶囊、加味逍遥丸等。\n穴位治疗：针灸可酌情取局部腧穴，如攒竹穴、鱼腰穴、阳白穴、四白穴、颧髎穴、地仓穴、颊车穴等，并加用期门穴、合谷穴、足三里穴、太冲穴等远端穴位。"
        ]
      }
    },
    "黄": {
      "无齿痕": {
        "status": "succeed",
        "type": "舌象",
        "describe": [
          "舌形与舌面\n红舌——有热邪\n舌尖红有芒刺表示心火上炎；舌色较红，舌苔黄且干燥表示内有实热；舌体红且舌苔少或无苔，则阴虚内热。\n主热证，可能是身体积热过多，同时观察舌面上是不是有红点。",
          "舌头的大小\n老舌——正邪对峙\n舌苔颜色黄白、灰黑，病多主实证、热证。\n老舌常见于正邪双方相持阶段，即病邪的气势很凶，但是机体本身的抵抗能力也很强",
          "舌头的大小\n胖大舌——内有虚寒\n注意观察舌头的颜色，舌苔以及舌面是否有红点等。\n舌苔偏黄者，多属于心脾热盛；舌体肿胀而舌色紫暗者，多属于瘀血阻络。"
        ],
        "recommend": [
          "按摩九大清热穴位：内庭穴，关冲穴，鱼际穴，厉兑穴，少冲穴，劳宫穴，涌泉穴，至阴穴，隐白穴，通过按摩这些穴位可以有效帮助气血流通，排出体内代谢废物，更好地发挥去火作用；\n白萝卜排骨汤，体内有实热的人身体健壮，无须进补，猪肉和白萝卜搭配，具有健脾润肤，健胃消食，顺气，利尿等功效，有助于滋阴清热。",
          "芦笋炒肉片，芦笋性凉，味甘苦，营养价值丰富，搭配猪肉可解腻，其中还有大量的膳食纤维可以促进肠道蠕动，排除热毒。",
          "先拔罐再刮痧除湿热，如果是偏热体质，又有痰湿积累，那么体内环境一定又湿又热又黏，先拔罐祛除水湿之气，再用刮痧泻热，还可以辅以按摩，温和地调理身体，巩固疗效；\n芳香食物可化湿，中医认为辛香之物气味浓烈，善于走串流通，有行气除湿之效，可将桂皮，香菜，生姜丝，陈皮等添加到饮食当中。"
        ]
      },
      "有齿痕": {
        "status": "succeed",
        "type": "舌形",
        "describe": [
          "气虚体质典型舌象\n暗淡舌，黄腻苔\n舌苔：黄腻\n舌质：暗淡\n舌体：两边有齿痕\n此舌象患者或同时有面色少华、手足不温、怠倦食少、便溏、咳嗽、短气、痰多等症状。",
          "湿热体质典型舌象\n胖大舌，深黄腻苔\n舌体：胖大，有齿痕\n舌苔：深黄、厚腻\n舌面：有裂纹、瘀斑\n此舌象患者或有发热、身热不扬，头痛而重、身重而痛、口干口苦、小便短赤、大便干结等症状。",
          "痰湿体质典型舌象\n胖淡舌，黄腻苔\n舌苔：薄、黄腻\n舌质：颜色淡\n舌体：胖大，有齿痕\n此舌象患者多表现为身体沉重、食欲旺盛、胸闷、痰多、汗多、手足心热等症状"
        ],
        "recommend": [
          "方药：多使用黄芪、甘草、钟乳、人参、桂心、茯苓、白术、五味子、麦冬、干姜、石英、紫菀、款冬花等组方。成药可以选择参苓白术、补肺丸等。\n穴位治疗：选择印堂穴、迎香穴、尺泽穴、列缺穴、风门穴、脾俞穴、肺俞穴、百会穴、合谷穴等。",
          "方药：可选用等量黄檗、蒲公英、苦参组方磨成粉外敷。内服选用龙胆草、栀子、甘草、生地黄、当归、大青叶、连翘、元胡、车前子、泽泻等组方。成药可选用龙胆泻肝汤丸等。\n穴位疗法：选择足三里穴、阴陵泉穴、三阴交穴、丰隆穴、风市穴、委中穴、膀胱俞穴、大肠俞穴、肾俞穴等。",
          "方药：可以选用防风、荆芥穗、薄荷、麻黄、大黄、芒硝、栀子、滑石、桔梗、石膏、川芎、当归、白术、白芍、黄芩、连翘、甘草、白术的组方。成药可以选用防风通圣丸。\n穴位疗法：选择膻中穴、上脘穴、中脘穴、下脘穴、不容穴、丰隆穴、足三里穴、三阴交穴等。"
        ]
      }
    },
    "黑": {
      "无齿痕": {
        "status": "succeed",
        "type": "舌象",
        "describe": [
          "舌苔的颜色\n黑苔——邪热加重\n黑干苔表示受到慢性病、发炎的影响；黑腻苔表示体内长期积累过多的热邪与湿气。\n黑苔显示病情较重，或是病情有慢性化的趋势。",
          "湿热体质典型舌象\n暗红舌，黑燥苔\n舌色：暗红\n舌面：少津\n舌苔：黑色燥苔\n这种舌象多为肝胆实热、热毒瘀结体内而呈现的舌象。同时，患者会伴有口苦、尿黄等全身症状。",
          "湿热体质典型舌象\n灰黑黄腻苔\n舌色：暗红\n舌面：有瘀点\n舌体：较大\n这种舌象多为肺胃有热，而成黄色舌苔；肝气郁结，肝气不舒形成舌边缘及舌尖瘀点。"
        ],
        "recommend": [
          "黑干苔者可“开天窗，鸣天鼓”养肾精：\n“开天窗”是将两手搓热，用手掌同时用力捂住两侧的耳朵，再快速地将双手向外松开；\n“鸣天鼓”是将后中指和拇指扣紧，中指快速持续地敲击脑后的枕骨及乳突；\n此法具有补肾生精，滋阴清热，健脑聪耳的作用；\n黑薄苔者可饮当归人参茶：取人参片，当归沸水冲泡饮用，人参大补元气，改善气虚，当归能活血补血。",
          "方药：以龙胆泻肝汤为主，药物以赤芍、龙胆草、黄芩、栀子、半夏、当归、夏枯草、半枝莲、仙鹤草、白花蛇舌草为主。\n穴位疗法：对于肿瘤引起的呕吐、头痛等可用针灸，取穴中脘穴、内关穴、足三里穴、风池穴、百会穴等。",
          "方药：以茵陈、栀子、大黄、柴胡、郁金、川楝子、当归、车前子、黄芪、党参、白花蛇舌草、半枝莲等组方。成药可服用大黄蛰虫丸、健脾益肾颗粒、扶正消症胶囊。\n穴位疗法：主要选大椎穴、至阳穴、阳陵泉穴、太冲穴等，适宜采用泻法。\n"
        ]
      },
      "有齿痕": {
        "status": "succeed",
        "type": "舌象",
        "describe": [
          "舌苔的颜色\n黑苔——邪热加重\n黑干苔表示受到慢性病、发炎的影响；黑腻苔表示体内长期积累过多的热邪与湿气。\n黑苔显示病情较重，或是病情有慢性化的趋势。",
          "湿热体质典型舌象\n暗红舌，黑燥苔\n舌色：暗红\n舌面：少津\n舌苔：黑色燥苔\n这种舌象多为肝胆实热、热毒瘀结体内而呈现的舌象。同时，患者会伴有口苦、尿黄等全身症状。",
          "湿热体质典型舌象\n灰黑黄腻苔\n舌色：暗红\n舌面：有瘀点\n舌体：较大\n这种舌象多为肺胃有热，而成黄色舌苔；肝气郁结，肝气不舒形成舌边缘及舌尖瘀点。"
        ],
        "recommend": [
          "黑干苔者可“开天窗，鸣天鼓”养肾精：\n“开天窗”是将两手搓热，用手掌同时用力捂住两侧的耳朵，再快速地将双手向外松开；\n“鸣天鼓”是将后中指和拇指扣紧，中指快速持续地敲击脑后的枕骨及乳突；\n此法具有补肾生精，滋阴清热，健脑聪耳的作用；\n黑薄苔者可饮当归人参茶：取人参片，当归沸水冲泡饮用，人参大补元气，改善气虚，当归能活血补血。",
          "方药：以龙胆泻肝汤为主，药物以赤芍、龙胆草、黄芩、栀子、半夏、当归、夏枯草、半枝莲、仙鹤草、白花蛇舌草为主。\n穴位疗法：对于肿瘤引起的呕吐、头痛等可用针灸，取穴中脘穴、内关穴、足三里穴、风池穴、百会穴等。",
          "方药：以茵陈、栀子、大黄、柴胡、郁金、川楝子、当归、车前子、黄芪、党参、白花蛇舌草、半枝莲等组方。成药可服用大黄蛰虫丸、健脾益肾颗粒、扶正消症胶囊。\n穴位疗法：主要选大椎穴、至阳穴、阳陵泉穴、太冲穴等，适宜采用泻法。\n"
        ]
      }
    }
  }
}